sterentev/atdf-device-asm-include/inc/ATmega2564RFR2.inc
; ----------	Register TIFR4 bits		------------------------
.equ	ICF4		= 5		; 0x20 - Timer/Counter4 Input Capture Flag
.equ	OCF4C		= 3		; 0x08 - Timer/Counter4 Output Compare C Match Flag
.equ	OCF4B		= 2		; 0x04 - Timer/Counter4 Output Compare B Match Flag
.equ	OCF4A		= 1		; 0x02 - Timer/Counter4 Output Compare A Match Flag
.equ	TOV4		= 0		; 0x01 - Timer/Counter4 Overflow Flag

; ----------	Register TCCR3A bits		------------------------
.equ	COM3A_MASK	= 0xC0		;      - Compare Output Mode for Channel A (2 bits)
.equ	COM3A0		= 6		;          COM3A BIT0 position
.equ	COM3B_MASK	= 0x30		;      - Compare Output Mode for Channel B (2 bits)
.equ	COM3B0		= 4		;          COM3B BIT0 position
.equ	COM3C_MASK	= 0x0C		;      - Compare Output Mode for Channel C (2 bits)
.equ	COM3C0		= 2		;          COM3C BIT0 position
.equ	TCCR3A_WGM3_MASK= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	TCCR3A_WGM30	= 0		;          TCCR3A_WGM3 BIT0 position
; ::::  COM3A	:::: bitfield values
;			0x00		; Normal port operation, OCnA/OCnB/OCnC disconnected.
;			0x40		; Toggle OCnA/OCnB/OCnC on Compare Match.
;			0x80		; Clear OCnA/OCnB/OCnC on Compare Match (set output to low level).
;			0xC0		; Set OCnA/OCnB/OCnC on Compare Match (set output to high level).
; ::::  COM3B	:::: bitfield values
;			0x00		; Normal port operation, OCnA/OCnB/OCnC disconnected.
;			0x10		; Toggle OCnA/OCnB/OCnC on Compare Match.
;			0x20		; Clear OCnA/OCnB/OCnC on Compare Match (set output to low level).
;			0x30		; Set OCnA/OCnB/OCnC on Compare Match (set output to high level).
; ::::  COM3C	:::: bitfield values
;			0x00		; Normal port operation, OCnA/OCnB/OCnC disconnected.
;			0x04		; Toggle OCnA/OCnB/OCnC on Compare Match.
;			0x08		; Clear OCnA/OCnB/OCnC on Compare Match (set output to low level).
;			0x0C		; Set OCnA/OCnB/OCnC on Compare Match (set output to high level).
; ::::  TCCR3A_WGM3	>>>> This is a part of TC1_WGMX_BITF enum (see complete values list below)

; ----------	Register TCCR3B bits		------------------------
.equ	ICNC3		= 7		; 0x80 - Input Capture 3 Noise Canceller
.equ	ICES3		= 6		; 0x40 - Input Capture 3 Edge Select
.equ	TCCR3B_Res	= 5		; 0x20 - Reserved Bit
.equ	TCCR3B_WGM3_MASK= 0x18		;      - Waveform Generation Mode (2 bits)
.equ	TCCR3B_WGM30	= 3		;          TCCR3B_WGM3 BIT0 position
.equ	CS3_MASK	= 0x07		;      - Clock Select (3 bits)
.equ	CS30		= 0		;          CS3 BIT0 position
; ::::  TCCR3B_WGM3	>>>> This is a part of TC1_WGMX_BITF enum (see complete values list below)
; ::::  CS3	:::: bitfield values
;			0x00		; No clock source (Timer/Counter stopped)
;			0x01		; clk_IO/1 (no prescaling)
;			0x02		; clk_IO/8 (from prescaler)
;			0x03		; clk_IO/64 (from prescaler)
;			0x04		; clk_IO/256 (from prescaler)
;			0x05		; clk_IO/1024 (from prescaler)
;			0x06		; External clock source on Tn pin, clock on falling edge
;			0x07		; External clock source on Tn pin, clock on rising edge

; ----------	Register TCCR3C bits		------------------------
.equ	FOC3A		= 7		; 0x80 - Force Output Compare for Channel A
.equ	FOC3B		= 6		; 0x40 - Force Output Compare for Channel B
.equ	FOC3C		= 5		; 0x20 - Force Output Compare for Channel C

; ----------	Register TIMSK3 bits		------------------------
.equ	ICIE3		= 5		; 0x20 - Timer/Counter3 Input Capture Interrupt Enable
.equ	OCIE3C		= 3		; 0x08 - Timer/Counter3 Output Compare C Match Interrupt Enable
.equ	OCIE3B		= 2		; 0x04 - Timer/Counter3 Output Compare B Match Interrupt Enable
.equ	OCIE3A		= 1		; 0x02 - Timer/Counter3 Output Compare A Match Interrupt Enable
.equ	TOIE3		= 0		; 0x01 - Timer/Counter3 Overflow Interrupt Enable

; ----------	Register TIFR3 bits		------------------------
.equ	ICF3		= 5		; 0x20 - Timer/Counter3 Input Capture Flag
.equ	OCF3C		= 3		; 0x08 - Timer/Counter3 Output Compare C Match Flag
.equ	OCF3B		= 2		; 0x04 - Timer/Counter3 Output Compare B Match Flag
.equ	OCF3A		= 1		; 0x02 - Timer/Counter3 Output Compare A Match Flag
.equ	TOV3		= 0		; 0x01 - Timer/Counter3 Overflow Flag

; ----------	Register TCCR1A bits		------------------------
.equ	COM1A_MASK	= 0xC0		;      - Compare Output Mode for Channel A (2 bits)
.equ	COM1A0		= 6		;          COM1A BIT0 position
.equ	COM1B_MASK	= 0x30		;      - Compare Output Mode for Channel B (2 bits)
.equ	COM1B0		= 4		;          COM1B BIT0 position
.equ	COM1C_MASK	= 0x0C		;      - Compare Output Mode for Channel C (2 bits)
.equ	COM1C0		= 2		;          COM1C BIT0 position
.equ	TCCR1A_WGM1_MASK= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	TCCR1A_WGM10	= 0		;          TCCR1A_WGM1 BIT0 position
; ::::  COM1A	:::: bitfield values
;			0x00		; Normal port operation, OCnA/OCnB/OCnC disconnected.
;			0x40		; Toggle OCnA/OCnB/OCnC on Compare Match.
;			0x80		; Clear OCnA/OCnB/OCnC on Compare Match (set output to low level).
;			0xC0		; Set OCnA/OCnB/OCnC on Compare Match (set output to high level).
; ::::  COM1B	:::: bitfield values
;			0x00		; Normal port operation, OCnA/OCnB/OCnC disconnected.
;			0x10		; Toggle OCnA/OCnB/OCnC on Compare Match.
;			0x20		; Clear OCnA/OCnB/OCnC on Compare Match (set output to low level).
;			0x30		; Set OCnA/OCnB/OCnC on Compare Match (set output to high level).
; ::::  COM1C	:::: bitfield values
;			0x00		; Normal port operation, OCnA/OCnB/OCnC disconnected.
;			0x04		; Toggle OCnA/OCnB/OCnC on Compare Match.
;			0x08		; Clear OCnA/OCnB/OCnC on Compare Match (set output to low level).
;			0x0C		; Set OCnA/OCnB/OCnC on Compare Match (set output to high level).
; ::::  TCCR1A_WGM1	>>>> This is a part of TC1_WGMX_BITF enum (see complete values list below)

; ----------	Register TCCR1B bits		------------------------
.equ	ICNC1		= 7		; 0x80 - Input Capture 1 Noise Canceller
.equ	ICES1		= 6		; 0x40 - Input Capture 1 Edge Select
.equ	TCCR1B_Res	= 5		; 0x20 - Reserved Bit
.equ	TCCR1B_WGM1_MASK= 0x18		;      - Waveform Generation Mode (2 bits)
.equ	TCCR1B_WGM10	= 3		;          TCCR1B_WGM1 BIT0 position
.equ	CS1_MASK	= 0x07		;      - Clock Select (3 bits)
.equ	CS10		= 0		;          CS1 BIT0 position
; ::::  TCCR1B_WGM1	>>>> This is a part of TC1_WGMX_BITF enum (see complete values list below)
; ::::  CS1	:::: bitfield values
;			0x00		; No clock source (Timer/Counter stopped)
;			0x01		; clk_IO/1 (no prescaling)
;			0x02		; clk_IO/8 (from prescaler)
;			0x03		; clk_IO/64 (from prescaler)
;			0x04		; clk_IO/256 (from prescaler)
;			0x05		; clk_IO/1024 (from prescaler)
;			0x06		; External clock source on Tn pin, clock on falling edge
;			0x07		; External clock source on Tn pin, clock on rising edge

