sterentev/atdf-device-asm-include/inc/ATmega2564RFR2.inc
; ----------	Register TRX_CTRL_1 bits	------------------------
.equ	PA_EXT_EN	= 7		; 0x80 - External PA support enable
.equ	IRQ_2_EXT_EN	= 6		; 0x40 - Connect Frame Start IRQ to TC1
.equ	TX_AUTO_CRC_ON	= 5		; 0x20 - Enable Automatic CRC Calculation
.equ	PLL_TX_FLT	= 4		; 0x10 - Enable PLL TX filter

; ----------	Register PHY_TX_PWR bits	------------------------
.equ	TX_PWR_MASK	= 0x0F		;      - Transmit Power Setting (4 bits)
.equ	TX_PWR0		= 0		;          TX_PWR BIT0 position
; ::::  TX_PWR	:::: bitfield values
;			0x00		; 3.5 dBm
;			0x01		; 3.3 dBm
;			0x02		; 2.8 dBm
;			0x03		; 2.3 dBm
;			0x04		; 1.8 dBm
;			0x05		; 1.2 dBm
;			0x06		; 0.5 dBm
;			0x07		; -0.5 dBm
;			0x08		; -1.5 dBm
;			0x09		; -2.5 dBm
;			0x0A		; -3.5 dBm
;			0x0B		; -4.5 dBm
;			0x0C		; -6.5 dBm
;			0x0D		; -8.5 dBm
;			0x0E		; -11.5 dBm
;			0x0F		; -16.5 dBm

; ----------	Register PHY_RSSI bits		------------------------
.equ	RX_CRC_VALID	= 7		; 0x80 - Received Frame CRC Status
.equ	RND_VALUE_MASK	= 0x60		;      - Random Value (2 bits)
.equ	RND_VALUE0	= 5		;          RND_VALUE BIT0 position
.equ	RSSI_MASK	= 0x1F		;      - Receiver Signal Strength Indicator (5 bits)
.equ	RSSI0		= 0		;          RSSI BIT0 position
; ::::  RX_CRC_VALID	:::: bitfield values
;			0x00		; CRC (FCS) not valid
;			0x80		; CRC (FCS) valid
; ::::  RSSI	:::: bitfield values
;			0x00		; Minimum RSSI value: P(RF) < -90 dBm
;			0x01		; P(RF) = RSSI_BASE_VAL+3 · (RSSI-1) [dBm]
;			0x02		; ...
;			0x1C		; Maximum RSSI value: P(RF) ≥ -10 dBm

; ----------	Register PHY_ED_LEVEL bits	------------------------
.equ	ED_LEVEL_MASK	= 0xFF		;      - Energy Detection Level (8 bits)
.equ	ED_LEVEL0	= 0		;          ED_LEVEL BIT0 position
; ::::  ED_LEVEL	:::: bitfield values
;			0x00		; Minimum result of last ED measurement
;			0x01		; P(RF) = RSSI_BASE_VAL+ED [dBm]
;			0x02		; ...
;			0x54		; Maximum result of last ED measurement
;			0xFF		; Reset value

; ----------	Register PHY_CC_CCA bits	------------------------
.equ	CCA_REQUEST	= 7		; 0x80 - Manual CCA Measurement Request
.equ	CCA_MODE_MASK	= 0x60		;      - Select CCA Measurement Mode (2 bits)
.equ	CCA_MODE0	= 5		;          CCA_MODE BIT0 position
.equ	CHANNEL_MASK	= 0x1F		;      - RX/TX Channel Selection (5 bits)
.equ	CHANNEL0	= 0		;          CHANNEL BIT0 position
; ::::  CCA_MODE	:::: bitfield values
;			0x00		; Mode 3a, Carrier sense OR energy above threshold
;			0x20		; Mode 1, Energy above threshold
;			0x40		; Mode 2, Carrier sense only
;			0x60		; Mode 3b, Carrier sense AND energy above threshold
; ::::  CHANNEL	:::: bitfield values
;			0x0B		; 2405 MHz
;			0x0C		; 2410 MHz
;			0x0D		; 2415 MHz
;			0x0E		; 2420 MHz
;			0x0F		; 2425 MHz
;			0x10		; 2430 MHz
;			0x11		; 2435 MHz
;			0x12		; 2440 MHz
;			0x13		; 2445 MHz
;			0x14		; 2450 MHz
;			0x15		; 2455 MHz
;			0x16		; 2460 MHz
;			0x17		; 2465 MHz
;			0x18		; 2470 MHz
;			0x19		; 2475 MHz
;			0x1A		; 2480 MHz

; ----------	Register CCA_THRES bits		------------------------
.equ	CCA_CS_THRES_MASK= 0xF0		;      - CS Threshold Level for CCA Measurement (4 bits)
.equ	CCA_CS_THRES0	= 4		;          CCA_CS_THRES BIT0 position
.equ	CCA_ED_THRES_MASK= 0x0F		;      - ED Threshold Level for CCA Measurement (4 bits)
.equ	CCA_ED_THRES0	= 0		;          CCA_ED_THRES BIT0 position

; ----------	Register RX_CTRL bits		------------------------
.equ	PDT_THRES_MASK	= 0x0F		;      - Receiver Sensitivity Control (4 bits)
.equ	PDT_THRES0	= 0		;          PDT_THRES BIT0 position
; ::::  PDT_THRES	:::: bitfield values
;			0x07		; Reset value, to be used if Antenna Diversity algorithm is disabled
;			0x03		; Recommended correlator threshold for Antenna Diversity operation

; ----------	Register SFD_VALUE bits		------------------------
.equ	SFD_VALUE_MASK	= 0xFF		;      - Start of Frame Delimiter Value (8 bits)
.equ	SFD_VALUE0	= 0		;          SFD_VALUE BIT0 position
; ::::  SFD_VALUE	:::: bitfield values
;			0xA7		; IEEE 802.15.4 compliant value of the SFD

; ----------	Register TRX_CTRL_2 bits	------------------------
.equ	RX_SAFE_MODE	= 7		; 0x80 - RX Safe Mode
.equ	OQPSK_DATA_RATE_MASK= 0x03		;      - Data Rate Selection (2 bits)
.equ	OQPSK_DATA_RATE0= 0		;          OQPSK_DATA_RATE BIT0 position
; ::::  OQPSK_DATA_RATE	:::: bitfield values
;			0x00		; 250 kb/s (IEEE 802.15.4 compliant)
;			0x01		; 500 kb/s
;			0x02		; 1000 kb/s
;			0x03		; 2000 kb/s

; ----------	Register ANT_DIV bits		------------------------
.equ	ANT_SEL		= 7		; 0x80 - Antenna Diversity Antenna Status
.equ	ANT_DIV_EN	= 3		; 0x08 - Enable Antenna Diversity
.equ	ANT_EXT_SW_EN	= 2		; 0x04 - Enable External Antenna Switch Control
.equ	ANT_CTRL_MASK	= 0x03		;      - Static Antenna Diversity Switch Control (2 bits)
.equ	ANT_CTRL0	= 0		;          ANT_CTRL BIT0 position
; ::::  ANT_SEL	:::: bitfield values
;			0x00		; Antenna 0
;			0x80		; Antenna 1
; ::::  ANT_DIV_EN	:::: bitfield values
;			0x00		; Antenna Diversity algorithm disabled
;			0x08		; Antenna Diversity algorithm enabled
; ::::  ANT_EXT_SW_EN	:::: bitfield values
;			0x00		; Antenna Diversity RF switch control disabled
;			0x04		; Antenna Diversity RF switch control enabled
; ::::  ANT_CTRL	:::: bitfield values
;			0x00		; Reserved
;			0x01		; Antenna 1: DIG1=H, DIG2=L
;			0x02		; Antenna 0: DIG1=L, DIG2=H
;			0x03		; Default value for ANT_EXT_SW_EN=0; Mandatory setting for applications not using Antenna Diversity

; ----------	Register IRQ_MASK bits		------------------------
.equ	AWAKE_EN	= 7		; 0x80 - Awake Interrupt Enable
.equ	TX_END_EN	= 6		; 0x40 - TX_END Interrupt Enable
.equ	AMI_EN		= 5		; 0x20 - Address Match Interrupt Enable
.equ	CCA_ED_DONE_EN	= 4		; 0x10 - End of ED Measurement Interrupt Enable
.equ	RX_END_EN	= 3		; 0x08 - RX_END Interrupt Enable
.equ	RX_START_EN	= 2		; 0x04 - RX_START Interrupt Enable
.equ	PLL_UNLOCK_EN	= 1		; 0x02 - PLL Unlock Interrupt Enable
.equ	PLL_LOCK_EN	= 0		; 0x01 - PLL Lock Interrupt Enable

; ----------	Register IRQ_STATUS bits	------------------------
.equ	AWAKE		= 7		; 0x80 - Awake Interrupt Status
.equ	TX_END		= 6		; 0x40 - TX_END Interrupt Status
.equ	AMI		= 5		; 0x20 - Address Match Interrupt Status
.equ	CCA_ED_DONE	= 4		; 0x10 - End of ED Measurement Interrupt Status
.equ	RX_END		= 3		; 0x08 - RX_END Interrupt Status
.equ	RX_START	= 2		; 0x04 - RX_START Interrupt Status
.equ	PLL_UNLOCK	= 1		; 0x02 - PLL Unlock Interrupt Status
.equ	PLL_LOCK	= 0		; 0x01 - PLL Lock Interrupt Status

