sterentev/atdf-device-asm-include/inc/ATmega2564RFR2.inc
; ----------	Register IRQ_MASK1 bits		------------------------
.equ	IRQ_MASK1_Res_MASK= 0xE0		;      - Reserved Bit (3 bits)
.equ	IRQ_MASK1_Res0	= 5		;          IRQ_MASK1_Res BIT0 position
.equ	MAF_3_AMI_EN	= 4		; 0x10 - Address Match Interrupt enable Address filter 3
.equ	MAF_2_AMI_EN	= 3		; 0x08 - Address Match Interrupt enable Address filter 2
.equ	MAF_1_AMI_EN	= 2		; 0x04 - Address Match Interrupt enable Address filter 1
.equ	MAF_0_AMI_EN	= 1		; 0x02 - Address Match Interrupt enable Address filter 0
.equ	TX_START_EN	= 0		; 0x01 - Transmit Start Interrupt enable

; ----------	Register IRQ_STATUS1 bits	------------------------
.equ	IRQ_STATUS1_Res_MASK= 0xE0		;      - Reserved Bit (3 bits)
.equ	IRQ_STATUS1_Res0= 5		;          IRQ_STATUS1_Res BIT0 position
.equ	MAF_3_AMI	= 4		; 0x10 - Address Match Interrupt Status Address filter 3
.equ	MAF_2_AMI	= 3		; 0x08 - Address Match Interrupt Status Address filter 2
.equ	MAF_1_AMI	= 2		; 0x04 - Address Match Interrupt Status Address filter 1
.equ	MAF_0_AMI	= 1		; 0x02 - Address Match Interrupt Status Address filter 0
.equ	TX_START	= 0		; 0x01 - Transmit Start Interrupt Status

; ----------	Register VREG_CTRL bits		------------------------
.equ	AVREG_EXT	= 7		; 0x80 - Use External AVDD Regulator
.equ	AVDD_OK		= 6		; 0x40 - AVDD Supply Voltage Valid
.equ	DVREG_EXT	= 3		; 0x08 - Use External DVDD Regulator
.equ	DVDD_OK		= 2		; 0x04 - DVDD Supply Voltage Valid
; ::::  AVREG_EXT	:::: bitfield values
;			0x00		; Internal AVDD voltage regulator for the analog section is enabled.
;			0x80		; Internal AVDD voltage regulator is disabled; use external regulated 1.8V supply voltage for the analog section.
; ::::  AVDD_OK	:::: bitfield values
;			0x00		; Analog voltage regulator disabled or supply voltage not stable
;			0x40		; Analog supply voltage has settled
; ::::  DVREG_EXT	:::: bitfield values
;			0x00		; Internal DVDD voltage regulator for the digital section is enabled.
;			0x08		; Internal DVDD voltage regulator is disabled; use external regulated 1.8V supply voltage for the digital section.
; ::::  DVDD_OK	:::: bitfield values
;			0x00		; Digital voltage regulator disabled or supply voltage not stable
;			0x04		; Digital supply voltage has settled

; ----------	Register BATMON bits		------------------------
.equ	BAT_LOW		= 7		; 0x80 - Battery Monitor Interrupt Status
.equ	BAT_LOW_EN	= 6		; 0x40 - Battery Monitor Interrupt Enable
.equ	BATMON_OK	= 5		; 0x20 - Battery Monitor Status
.equ	BATMON_HR	= 4		; 0x10 - Battery Monitor Voltage Range
.equ	BATMON_VTH_MASK	= 0x0F		;      - Battery Monitor Threshold Voltage (4 bits)
.equ	BATMON_VTH0	= 0		;          BATMON_VTH BIT0 position
; ::::  BATMON_OK	:::: bitfield values
;			0x00		; The battery voltage is below the threshold.
;			0x20		; The battery voltage is above the threshold.
; ::::  BATMON_HR	:::: bitfield values
;			0x00		; Enables the low range, see BATMON_VTH
;			0x10		; Enables the high range, see BATMON_VTH
; ::::  BATMON_VTH	:::: bitfield values
;			0x00		; 2.550V / 1.70V (BATMON_HR=1/0)
;			0x01		; 2.625V / 1.75V (BATMON_HR=1/0)
;			0x02		; 2.700V / 1.80V (BATMON_HR=1/0)
;			0x03		; 2.775V / 1.85V (BATMON_HR=1/0)
;			0x04		; 2.850V / 1.90V (BATMON_HR=1/0)
;			0x05		; 2.925V / 1.95V (BATMON_HR=1/0)
;			0x06		; 3.000V / 2.00V (BATMON_HR=1/0)
;			0x07		; 3.075V / 2.05V (BATMON_HR=1/0)
;			0x08		; 3.150V / 2.10V (BATMON_HR=1/0)
;			0x09		; 3.225V / 2.15V (BATMON_HR=1/0)
;			0x0A		; 3.300V / 2.20V (BATMON_HR=1/0)
;			0x0B		; 3.375V / 2.25V (BATMON_HR=1/0)
;			0x0C		; 3.450V / 2.30V (BATMON_HR=1/0)
;			0x0D		; 3.525V / 2.35V (BATMON_HR=1/0)
;			0x0E		; 3.600V / 2.40V (BATMON_HR=1/0)
;			0x0F		; 3.675V / 2.45V (BATMON_HR=1/0)

; ----------	Register XOSC_CTRL bits		------------------------
.equ	XTAL_MODE_MASK	= 0xF0		;      - Crystal Oscillator Operating Mode (4 bits)
.equ	XTAL_MODE0	= 4		;          XTAL_MODE BIT0 position
.equ	XTAL_TRIM_MASK	= 0x0F		;      - Crystal Oscillator Load Capacitance Trimming (4 bits)
.equ	XTAL_TRIM0	= 0		;          XTAL_TRIM BIT0 position
; ::::  XTAL_MODE	:::: bitfield values
;			0x40		; Internal crystal oscillator disabled; use external reference frequency.
;			0xF0		; Internal crystal oscillator enabled; amplitude regulation of oscillation enabled.
; ::::  XTAL_TRIM	:::: bitfield values
;			0x00		; 0.0 pF, trimming capacitors disconnected
;			0x01		; 0.3 pF, trimming capacitor switched on
;			0x02		; ...
;			0x0F		; 4.5 pF, trimming capacitor switched on

; ----------	Register CC_CTRL_0 bits		------------------------
.equ	CC_NUMBER_MASK	= 0xFF		;      - Channel Number (8 bits)
.equ	CC_NUMBER0	= 0		;          CC_NUMBER BIT0 position

; ----------	Register CC_CTRL_1 bits		------------------------
.equ	CC_BAND_MASK	= 0x0F		;      - Channel Band (4 bits)
.equ	CC_BAND0	= 0		;          CC_BAND BIT0 position

; ----------	Register RX_SYN bits		------------------------
.equ	RX_PDT_DIS	= 7		; 0x80 - Prevent Frame Reception
.equ	RX_OVERRIDE	= 6		; 0x40 - Receiver Override Function
.equ	RX_PDT_LEVEL_MASK= 0x0F		;      - Reduce Receiver Sensitivity (4 bits)
.equ	RX_PDT_LEVEL0	= 0		;          RX_PDT_LEVEL BIT0 position
; ::::  RX_PDT_LEVEL	:::: bitfield values
;			0x00		; RX_THRES ≤ RSSI_BASE_VAL (Reset value); RSSI value not considered
;			0x01		; RX_THRES > RSSI_BASE_VAL + 0 · 3; RSSI > -90 dBm
;			0x02		; ...
;			0x0E		; RX_THRES > RSSI_BASE_VAL + 13 · 3; RSSI > -51 dBm
;			0x0F		; RX_THRES > RSSI_BASE_VAL + 14 · 3; RSSI > -48 dBm

; ----------	Register TRX_RPC bits		------------------------
.equ	RX_RPC_CTRL_MASK= 0xC0		;      - Smart Receiving Mode Timing (2 bits)
.equ	RX_RPC_CTRL0	= 6		;          RX_RPC_CTRL BIT0 position
.equ	RX_RPC_EN	= 5		; 0x20 - Receiver Smart Receiving Mode Enable
.equ	PDT_RPC_EN	= 4		; 0x10 - Smart Receiving Mode Reduced Sensitivity Enable
.equ	PLL_RPC_EN	= 3		; 0x08 - PLL Smart Receiving Mode Enable
.equ	TRX_RPC_Res0	= 2		; 0x04 - Reserved
.equ	IPAN_RPC_EN	= 1		; 0x02 - Smart Receiving Mode IPAN Handling Enable
.equ	XAH_RPC_EN	= 0		; 0x01 - Smart Receiving in Extended Operating Modes Enable
; ::::  RX_RPC_CTRL	:::: bitfield values
;			0x00		; Activates minimum power saving behaviour for smart receiving mode
;			0x40		; Reserved
;			0x80		; Reserved
;			0xC0		; Activates maximum power saving behaviour for smart receiving mode

