sterentev/atdf-device-asm-include/inc/ATmega2564RFR2.inc
; ----------	Register GPIOR2 bits		------------------------
.equ	GPIOR_MASK	= 0xFF		;      - General Purpose I/O Register 2 Value (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR1 bits		------------------------
;.equ	GPIOR_MASK	= 0xFF		;      - General Purpose I/O Register 1 Value (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR0 bits		------------------------
.equ	GPIOR07		= 7		; 0x80 - General Purpose I/O Register 0 Value
.equ	GPIOR06		= 6		; 0x40 - General Purpose I/O Register 0 Value
.equ	GPIOR05		= 5		; 0x20 - General Purpose I/O Register 0 Value
.equ	GPIOR04		= 4		; 0x10 - General Purpose I/O Register 0 Value
.equ	GPIOR03		= 3		; 0x08 - General Purpose I/O Register 0 Value
.equ	GPIOR02		= 2		; 0x04 - General Purpose I/O Register 0 Value
.equ	GPIOR01		= 1		; 0x02 - General Purpose I/O Register 0 Value
.equ	GPIOR00		= 0		; 0x01 - General Purpose I/O Register 0 Value

; ----------	Register PRR2 bits		------------------------
.equ	PRRAM3		= 3		; 0x08 - Power Reduction SRAM3
.equ	PRRAM2		= 2		; 0x04 - Power Reduction SRAM2
.equ	PRRAM1		= 1		; 0x02 - Power Reduction SRAM1
.equ	PRRAM0		= 0		; 0x01 - Power Reduction SRAM0

; ----------	Register PRR1 bits		------------------------
.equ	PRR1_Res	= 7		; 0x80 - Reserved Bit
.equ	PRTRX24		= 6		; 0x40 - Power Reduction Transceiver
.equ	PRTIM5		= 5		; 0x20 - Power Reduction Timer/Counter5
.equ	PRTIM4		= 4		; 0x10 - Power Reduction Timer/Counter4
.equ	PRTIM3		= 3		; 0x08 - Power Reduction Timer/Counter3
.equ	PRUSART1	= 0		; 0x01 - Power Reduction USART1

; ----------	Register PRR0 bits		------------------------
.equ	PRTWI		= 7		; 0x80 - Power Reduction TWI
.equ	PRTIM2		= 6		; 0x40 - Power Reduction Timer/Counter2
.equ	PRTIM0		= 5		; 0x20 - Power Reduction Timer/Counter0
.equ	PRPGA		= 4		; 0x10 - Power Reduction PGA
.equ	PRTIM1		= 3		; 0x08 - Power Reduction Timer/Counter1
.equ	PRSPI		= 2		; 0x04 - Power Reduction Serial Peripheral Interface
.equ	PRUSART0	= 1		; 0x02 - Power Reduction USART
.equ	PRADC		= 0		; 0x01 - Power Reduction ADC



; ====	FLASH MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register NEMCR bits		------------------------
.equ	ENEAM		= 6		; 0x40 - Enable Extended Address Mode for Extra Rows
.equ	AEAM_MASK	= 0x30		;      - Address for Extended Address Mode of Extra Rows (2 bits)
.equ	AEAM0		= 4		;          AEAM BIT0 position
; ::::  AEAM	:::: bitfield values
;			0x00		; Factory Row
;			0x10		; User Row 1
;			0x20		; User Row 2
;			0x30		; User Row 3

; ----------	Register BGCR bits		------------------------
.equ	BGCR_Res	= 7		; 0x80 - Reserved Bit
.equ	BGCAL_FINE_MASK	= 0x78		;      - Fine Calibration Bits (4 bits)
.equ	BGCAL_FINE0	= 3		;          BGCAL_FINE BIT0 position
.equ	BGCAL_MASK	= 0x07		;      - Coarse Calibration Bits (3 bits)
.equ	BGCAL0		= 0		;          BGCAL BIT0 position
; ::::  BGCAL_FINE	:::: bitfield values
;			0x00		; Center value
;			0x08		; Voltage step up
;			0x40		; Voltage step down
;			0x38		; Setting for highest voltage
;			0x78		; Setting for lowest voltage
; ::::  BGCAL	:::: bitfield values
;			0x04		; Center value
;			0x03		; Voltage step up
;			0x05		; Voltage step down
;			0x00		; Setting for highest voltage
;			0x07		; Setting for lowest voltage



; ====	PWRCTRL MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register TRXPR bits		------------------------
.equ	SLPTR		= 1		; 0x02 - Multi-purpose Transceiver Control Bit
.equ	TRXRST		= 0		; 0x01 - Force Transceiver Reset

; ----------	Register DRTRAM0 bits		------------------------
.equ	DRTSWOK		= 5		; 0x20 - DRT Switch OK
.equ	ENDRT		= 4		; 0x10 - Enable SRAM Data Retention

; ----------	Register DRTRAM1 bits		------------------------
;.equ	DRTSWOK		= 5		; 0x20 - DRT Switch OK
;.equ	ENDRT		= 4		; 0x10 - Enable SRAM Data Retention

; ----------	Register DRTRAM2 bits		------------------------
.equ	DRTRAM2_Res	= 6		; 0x40 - Reserved Bit
;.equ	DRTSWOK		= 5		; 0x20 - DRT Switch OK
;.equ	ENDRT		= 4		; 0x10 - Enable SRAM Data Retention

; ----------	Register DRTRAM3 bits		------------------------
;.equ	DRTSWOK		= 5		; 0x20 - DRT Switch OK
;.equ	ENDRT		= 4		; 0x10 - Enable SRAM Data Retention

; ----------	Register LLDRL bits		------------------------
.equ	LLDRL_MASK	= 0x0F		;      - Low-Byte Data Register Bits (4 bits)
.equ	LLDRL0		= 0		;          LLDRL BIT0 position
; ::::  LLDRL	:::: bitfield values
;			0x00		; Calibration limit for fast process corner/high output voltage
;			0x01		; Calibration limit for slow process corner/low output voltage

; ----------	Register LLDRH bits		------------------------
.equ	LLDRH_MASK	= 0x1F		;      - High-Byte Data Register Bits (5 bits)
.equ	LLDRH0		= 0		;          LLDRH BIT0 position
; ::::  LLDRH	:::: bitfield values
;			0x00		; Calibration limit for fast process corner/high output voltage
;			0x01		; Calibration limit for slow process corner/low output voltage

; ----------	Register LLCR bits		------------------------
.equ	LLCR_Res_MASK	= 0xC0		;      - Reserved Bit (2 bits)
.equ	LLCR_Res0	= 6		;          LLCR_Res BIT0 position
.equ	LLDONE		= 5		; 0x20 - Calibration Done
.equ	LLCOMP		= 4		; 0x10 - Comparator Output
.equ	LLCAL		= 3		; 0x08 - Calibration Active
.equ	LLTCO		= 2		; 0x04 - Temperature Coefficient of Current Source
.equ	LLSHORT		= 1		; 0x02 - Short Lower Calibration Circuit
.equ	LLENCAL		= 0		; 0x01 - Enable Automatic Calibration

; ----------	Register DPDS0 bits		------------------------
.equ	PFDRV_MASK	= 0xC0		;      - Driver Strength Port F (2 bits)
.equ	PFDRV0		= 6		;          PFDRV BIT0 position
.equ	PEDRV_MASK	= 0x30		;      - Driver Strength Port E (2 bits)
.equ	PEDRV0		= 4		;          PEDRV BIT0 position
.equ	PDDRV_MASK	= 0x0C		;      - Driver Strength Port D (2 bits)
.equ	PDDRV0		= 2		;          PDDRV BIT0 position
.equ	PBDRV_MASK	= 0x03		;      - Driver Strength Port B (2 bits)
.equ	PBDRV0		= 0		;          PBDRV BIT0 position
; ::::  PFDRV	:::: bitfield values
;			0x00		; 2 mA
;			0x40		; 4 mA
;			0x80		; 6 mA
;			0xC0		; 8 mA
; ::::  PEDRV	:::: bitfield values
;			0x00		; 2 mA
;			0x10		; 4 mA
;			0x20		; 6 mA
;			0x30		; 8 mA
; ::::  PDDRV	:::: bitfield values
;			0x00		; 2 mA
;			0x04		; 4 mA
;			0x08		; 6 mA
;			0x0C		; 8 mA
; ::::  PBDRV	:::: bitfield values
;			0x00		; 2 mA
;			0x01		; 4 mA
;			0x02		; 6 mA
;			0x03		; 8 mA

; ----------	Register DPDS1 bits		------------------------
.equ	PGDRV_MASK	= 0x03		;      - Driver Strength Port G (2 bits)
.equ	PGDRV0		= 0		;          PGDRV BIT0 position
; ::::  PGDRV	:::: bitfield values
;			0x00		; 2 mA
;			0x01		; 4 mA
;			0x02		; 6 mA
;			0x03		; 8 mA

; ----------	Register MCUCR bits		------------------------
;.equ	PUD		= 4		; 0x10 - Pull-up Disable




